app/views/users/show.html.erb

SELECT  "gyms".* FROM "gyms" INNER JOIN "memberships" ON "gyms"."id" = "memberships"."gym_id" WHERE "memberships"."user_id" = ?  ORDER BY "gyms"."id" ASC LIMIT 1  [["user_id", 5]]
---

<% if current_user.gyms.count == 0 %>