app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "uid", "name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["provider", "facebook"], ["uid", "2510154757129"]]
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth['provider'],
      :uid => auth['uid']).first || User.create_with_omniauth(auth)