app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def show
    @all_users = User.all

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "greg@greg.com"]]
---
  def login
    @user = User.find_by_email(params['login']['email'])